#### MaterialNode Members

---

|  |
| --- |
| MaterialNode Class   Methods   Properties   See Also |

The  MaterialNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RenderNode  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAppearance | Appearance properties associated with the material. |
| Public method | GetAppearanceOverride | Returns appearance properties that override the preset appearance of the material. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Color | The color the material is being rendered at |
| Public property | Glossiness | The level of glossiness of the material |
| Public property | HasOverriddenAppearance | Identifies if the default rendering appearance the material has is being overridden. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RenderNode  .) |
| Public property | MaterialId | The Id of the element assocated with this material in the model. |
| Public property | NodeName | A readable name of the output node. (Inherited from  RenderNode  .) |
| Public property | Smoothness | The level of smoothness of the material. |
| Public property | ThumbnailFile | The path if a file that contains a thumbnail image of the material. |
| Public property | Transparency | The value of transparency the material is being rendered with |

# See Also

MaterialNode Class

Autodesk.Revit.DB Namespace